module.exports = {
  name: "help",
  alias: ["menu", "h", "helpm", "helpmenu"],
  desc: "Gives all bot commands list",
  react: "🖤",
  category: "Core",
  start: async (
    Miku,
    m,
    { prefix, pushName, ECOstatus, NSFWstatus, args, commands, text }
  ) => {
    if (args[0]) {
      let data = [];
      let name = args[0].toLowerCase();
      let cmd =
        commands.get(name) ||
        Array.from(commands.values()).find((v) => v.alias.includes(name));
      if (!cmd || cmd.type == "hide") return m.reply("No Command Found");
      else
        data.push(
          `🐈‍⬛Command : ${cmd.name.replace(/^\w/, (c) => c.toUpperCase())}`
        );
      if (cmd.alias) data.push(`🦄Alias : ${cmd.alias.join(", ")}`);
      if (cmd.cool) data.push(`⏱️Cooldown: ${cmd.cool}`);
      if (cmd.desc) data.push(`🧾Description : ${cmd.desc}`);
      if (cmd.usage)
        data.push(
          `🕊️Example : ${cmd.usage
            .replace(/%prefix/gi, prefix)
            .replace(/%command/gi, cmd.name)
            .replace(/%text/gi, text)}`
        );
      var buttonss = [
        {
          buttonId: `${prefix}help`,
          buttonText: { displayText: `help` },
          type: 1,
        },
      ];
      let buth = {
        text: `ℹ️Command Info\n\n${data.join("\n")}`,
        footer: `${botName}`,
        buttons: buttonss,
        headerType: 1,
      };
      return Miku.sendMessage(m.from, buth, { quoted: m });
    } else {
      const pad = (s) => (s < 10 ? "0" : "") + s;
        const formatTime = (seconds) => {
        const hours = Math.floor(seconds / (60 * 60));
        const minutes = Math.floor((seconds % (60 * 60)) / 60);
        const secs = Math.floor(seconds % 60);
        return time = `${pad(hours)}:${pad(minutes)}:${pad(secs)}`;
        };
        const uptime = () => formatTime(process.uptime());

const now = new Date();
        const hour = now.getHours();

       let greeting;
        if (hour >= 0 && hour < 12) {
          greeting = "Ohayou gozaimasu"; //good morning
        } else if (hour >= 12 && hour < 18) {
          greeting = "Konnichiwa"; //good afternoon
        } else {
          greeting = "Konbanwa"; //good evening
        }
      let textHelpMenu = `${greeting} *${pushName}* Senpai,

I am *${botName}*, a bot Edited by *Team Celestic*.

🐈‍⬛ My prefix is: *${prefix}*

🥵 Server Uptime: *${uptime()}*

Here's the list of my Commands.\n
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦         CORE         ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃                       
┃┄⊰❀ ʜɪ  
┃┄⊰❀ ʜᴇʟᴘ
┃┄⊰❀ ᴏᴡɴᴇʀ
┃┄⊰❀ ʀᴀɴᴋ
┃┄⊰❀ ꜱᴛᴀʟᴋ
┃┄⊰❀ ꜱᴜᴘᴘᴏʀᴛ
┃┄⊰❀ ᴄᴏᴜᴘʟᴇᴘᴘ
┃
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦        GROUPS       ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃                       
┃┄⊰❀ ᴀᴅᴍɪɴꜱ         
┃┄⊰❀ ʀᴇᴍᴏᴠᴇ
┃┄⊰❀ ɢᴄʟɪɴᴋ
┃┄⊰❀ ᴅᴇʟᴇᴛᴇ
┃┄⊰❀ ᴅᴇᴍᴏᴛᴇ
┃┄⊰❀ ɢʀᴏᴜᴘ
┃┄⊰❀ ʟᴇᴀᴠᴇ
┃┄⊰❀ ɴꜱꜰᴡ 
┃┄⊰❀ ᴛᴀɢᴀʟʟ
┃┄⊰❀ ᴡᴇʟᴄᴏᴍᴇ
┃┄⊰❀ ᴘʀᴏᴍᴏᴛᴇ
┃┄⊰❀ ʜɪᴅᴇᴛᴀɢ
┃┄⊰❀ ꜱᴇᴛᴘᴘɢᴄ
┃┄⊰❀ ʀᴇᴠᴏᴋᴇ
┃┄⊰❀ ʀᴇᴘᴏʀᴛ
┃┄⊰❀ ᴀɴɴᴏᴜɴᴄᴇ
┃┄⊰❀ ʙᴏᴛꜱᴡɪᴛᴄʜ
┃┄⊰❀ ᴄʜᴀᴛʙᴏᴛɢᴄ
┃┄⊰❀ ɢʀᴏᴜᴘɪɴꜰᴏ
┃┄⊰❀ ꜱᴇᴛɢᴄᴅᴇꜱᴄ
┃┄⊰❀ ᴀɴᴛɪʟɪɴᴋɢᴄ
┃┄⊰❀ ᴄʜᴀɴɢᴇɢᴄɴᴀᴍᴇ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦         MODS        ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ʙᴀɴ
┃┄⊰❀ ᴜɴʙᴀɴ
┃┄⊰❀ ᴀᴅᴅᴍᴏᴅ
┃┄⊰❀ ᴅᴇʟᴇᴛᴇᴍᴏᴅ
┃┄⊰❀ ʙᴀɴɢᴄ
┃┄⊰❀ ᴜɴʙᴀɴɢᴄ
┃┄⊰❀ ʙʟᴏᴄᴋ
┃┄⊰❀ ᴜɴʙʟᴏᴄᴋ
┃┄⊰❀ ᴍᴏᴅᴇ
┃┄⊰❀ ʙᴀɴʟɪꜱᴛ
┃┄⊰❀ ᴄʜᴀʀʟɪꜱᴛ
┃┄⊰❀ ʙʀᴏᴀᴅᴄᴀꜱᴛ
┃┄⊰❀ ᴘᴍᴄʜᴀᴛʙᴏᴛ
┃┄⊰❀ ꜱᴇᴛᴄʜᴀʀᴀᴄᴛᴇʀ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦        DEVS       ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ᴀᴅᴅɢᴏʟᴅ (ᴀɢ)
┃┄⊰❀ ʀᴇᴍᴏᴠᴇɢᴏʟᴅ (ʀɢ)
┃┄⊰❀ ᴘʀᴏᴍᴏᴛᴇᴍᴏᴅ (ᴘᴍ)
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦        MEDIA      ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ɪɢᴅʟ
┃┄⊰❀ ꜱᴏɴɢ <ꜱᴏɴɢ ɴᴀᴍᴇ>, 
┃┄⊰❀ ᴠɪᴅᴇᴏ <ᴠɪᴅᴇᴏ ɴᴀᴍᴇ>,
┃┄⊰❀ ʏᴛᴍᴘ3 <ʟɪɴᴋ>, 
┃┄⊰❀ ʏᴛᴍᴘ4 <ʟɪɴᴋ>, 
┃┄⊰❀ ʏᴛᴅᴏᴄ <ʟɪɴᴋ>
┃┄⊰❀ ᴘʟᴀʏʟɪꜱᴛ
┃┄⊰❀ ʏᴛꜱ
┃┄⊰❀ ᴛɪᴋᴛᴏᴋᴀᴜᴅɪᴏ <ʟɪɴᴋ>
┃┄⊰❀ ᴛɪᴋᴛᴏᴋᴠɪᴅᴇᴏ <ʟɪɴᴋ>, 
┃┄⊰❀ ᴛɪᴄᴛᴏᴋᴅᴏᴄ <ʟɪɴᴋ>,
┃
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦     ╔═════ஓ๑♡๑ஓ═════╗
✦────✦      SEARCH      ✦────✦
✦     ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ᴀɴɪᴍᴇ
┃┄⊰❀ ɢɪꜰꜱᴇᴀʀᴄʜ
┃┄⊰❀ ɢɪᴍᴀɢᴇ
┃┄⊰❀ ᴘɪɴᴛᴇʀᴇꜱᴛ
┃┄⊰❀ ɢɪᴛʜᴜʙ
┃┄⊰❀ ɢᴏᴏɢʟᴇ
┃┄⊰❀ ʟʏʀɪᴄꜱ
┃┄⊰❀ ʀɪɴɢᴛᴏɴᴇ
┃┄⊰❀ ꜱᴛɪᴄᴋᴇʀꜱᴇᴀʀᴄʜ
┃┄⊰❀ ᴡᴇᴀᴛʜᴇʀ
┃┄⊰❀ ʏᴏᴜᴛᴜʙᴇꜱᴇᴀʀᴄʜ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦       UTILITIES       ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ꜱᴛᴇᴀʟ
┃┄⊰❀ ᴛᴏᴀᴜᴅɪᴏ
┃┄⊰❀ ᴛᴏᴍᴘ3
┃┄⊰❀ ᴛᴏᴍᴘ4
┃┄⊰❀ ᴛᴏᴜʀʟ
┃┄⊰❀ ꜱᴛɪᴄᴋᴇʀᴍᴇᴍᴇ
┃┄⊰❀ ᴛᴇxᴛᴅᴇꜱɪɢɴ
┃┄⊰❀ ᴇᴍᴏᴊɪᴍɪx
┃┄⊰❀ Q / Qᴜᴏᴛᴇ
┃┄⊰❀ ꜱᴛɪᴄᴋᴇʀ
┃┄⊰❀ ꜱᴛɪᴄᴋᴇʀᴄʀᴏᴘ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦      IMAGE EDIT     ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ʙʟᴜʀ
┃┄⊰❀ ᴄɪʀᴄʟᴇ
┃┄⊰❀ ᴊᴀɪʟ
┃┄⊰❀ ʀᴇᴍᴏᴠᴇʙɢ
┃┄⊰❀ ᴛʀɪɢɢᴇʀ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦      AUDIO EDIT      ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ʙᴀꜱꜱ
┃┄⊰❀ ʙʟᴏᴡɴ
┃┄⊰❀ ᴅᴇᴇᴘ
┃┄⊰❀ ꜰᴀᴛ
┃┄⊰❀ ɴɪɢʜᴛᴄᴏʀᴇ
┃┄⊰❀ ʀᴇᴠᴇʀꜱᴇ
┃┄⊰❀ ʀᴏʙᴏᴛ
┃┄⊰❀ ꜱʟᴏᴡ
┃┄⊰❀ ꜱᴍᴏᴏᴛʜ
┃┄⊰❀ ᴛᴇᴍᴘᴏ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦       ╔═════ஓ๑♡๑ஓ═════╗
✦────✦      ESSENTIALS      ✦────✦
✦       ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ᴇʟᴇᴍᴇɴᴛ
┃┄⊰❀ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ
┃┄⊰❀ Qᴜᴇꜱᴛɪᴏɴ
┃┄⊰❀ ꜱᴀʏ
┃┄⊰❀ ꜱᴀʏᴊᴀᴘᴀɴᴇꜱᴇ
┃┄⊰❀ ꜱᴀʏʙᴇɴɢᴀʟɪ
┃┄⊰❀ ꜱᴀʏʜɪɴᴅɪ
┃┄⊰❀ ᴜᴅɪᴄᴛɪᴏɴᴀʀʏ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦       ╔═════ஓ๑♡๑ஓ═════╗
✦────✦         WEEB          ✦────✦
✦       ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ᴍᴀɪᴅ
┃┄⊰❀ ᴡᴀɪꜰᴜ
┃┄⊰❀ ꜰᴏxɢɪʀʟ
┃┄⊰❀ ᴄᴏꜱᴘʟᴀʏ
┃┄⊰❀ ᴡᴀʟʟᴘᴀᴘᴇʀ
┃┄⊰❀ ᴀɴɪᴍᴇQᴜᴏᴛᴇ
┃┄⊰❀ ᴄᴏꜱᴘʟᴀʏᴠɪᴅᴇᴏ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀           
✦       ╔═════ஓ๑♡๑ஓ═════╗
✦────✦      REACTIONS       ✦────✦
✦       ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ᴘᴀᴛ
┃┄⊰❀ ᴄʀʏ
┃┄⊰❀ ʜᴜɢ
┃┄⊰❀ ᴋɪᴄᴋ
┃┄⊰❀ ᴋɪʟʟ
┃┄⊰❀ ꜱʟᴀᴘ
┃┄⊰❀ ʏᴇᴇᴛ
┃┄⊰❀ ᴋɪꜱꜱ
┃┄⊰❀ ʙɪᴛᴇ
┃┄⊰❀ ᴡᴀᴠᴇ
┃┄⊰❀ ᴡɪɴᴋ
┃┄⊰❀ ʙᴏɴᴋ
┃┄⊰❀ ʜᴀᴘᴘʏ
┃┄⊰❀ ꜱᴍɪʟᴇ
┃┄⊰❀ ʙᴜʟʟʏ
┃┄⊰❀ ᴅᴀɴᴄᴇ
┃┄⊰❀ ʜɪɢʜꜰɪᴠᴇ
┃┄⊰❀ ʙᴇʜᴀᴘᴘʏ
┃┄⊰❀ ʜᴀɴᴅʜᴏɴᴅ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀           
✦       ╔═════ஓ๑♡๑ஓ═════╗
✦────✦     LOGO MAKER     ✦────✦
✦       ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ 🐈‍⬛ 3ᴅᴄʜʀɪꜱᴛᴍᴀꜱ, 3ᴅɴᴇᴏɴ, 
┃┄⊰❀ 🐈‍⬛ 3ᴅꜱᴘᴀᴄᴇ, 3ᴅꜱᴛᴏɴᴇ,
┃┄⊰❀ 🐈‍⬛ ʙᴇᴀʀ, ʙʟᴀᴄᴋᴘɪɴᴋ,
┃┄⊰❀ 🐈‍⬛ ʙʟᴏᴏᴅ, ʙᴏᴋᴇʜ, 
┃┄⊰❀ 🐈‍⬛ ᴄᴀɴᴅʏ, ᴄᴀʀʙᴏɴ, 
┃┄⊰❀ 🐈‍⬛ ᴄʜᴏᴄᴏʟᴀᴛᴇ, ᴄʜʀɪꜱᴛᴍᴀꜱ, 
┃┄⊰❀ 🐈‍⬛ ᴄɪʀᴄᴜɪᴛ, ᴄʟᴏᴜᴅ, 
┃┄⊰❀ 🐈‍⬛ ᴅᴇᴇᴘꜱᴇᴀ, ᴅᴇᴍᴏɴ, 
┃┄⊰❀ 🐈‍⬛ ᴅʀᴏᴘᴡᴀᴛᴇʀ, ɢʟɪᴛᴄʜ, 
┃┄⊰❀ 🐈‍⬛ ɢʟɪᴛᴄʜ2, ɢʟɪᴛᴄʜ3 
┃┄⊰❀ 🐈‍⬛ ɢʀᴀꜰꜰɪᴛɪ, ʜᴏʟʟᴏɢʀᴀᴘʜɪᴄ, 
┃┄⊰❀ 🐈‍⬛ ᴊᴏᴋᴇʀ, ʟɪᴏɴ , ᴍᴀɢᴍᴀ, 
┃┄⊰❀ 🐈‍⬛ ᴍᴀᴛʀɪx, ɴᴇᴏɴ, 
┃┄⊰❀ 🐈‍⬛ ɴᴇᴏɴᴅᴇᴠɪʟ, ɴᴇᴏɴɢʀᴇᴇɴ, 
┃┄⊰❀ 🐈‍⬛ ɴᴇᴏɴʟɪɢʜᴛ, ᴘᴀᴘᴇʀᴄᴜᴛ, 
┃┄⊰❀ 🐈‍⬛ ᴘᴇɴᴄɪʟ, ᴘᴏʀɴʜᴜʙ, 
┃┄⊰❀ 🐈‍⬛ ꜱᴄɪꜰɪ, ꜱᴘᴀʀᴋʟᴇᴄʜʀɪꜱᴛᴍᴀꜱ, 
┃┄⊰❀ 🐈‍⬛ ᴛʜᴜɴᴅᴇʀ, ᴛʜᴜɴᴅᴇʀ2, 
┃┄⊰❀ 🐈‍⬛ ᴛʀᴀɴꜱꜰᴏʀᴍᴇʀ, ᴡᴀʟʟ,
┃┄⊰❀ 🐈‍⬛ ᴡᴏʟꜰ
┃┄⊰❀
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀
✦     ╔═════ஓ๑♡๑ஓ═════╗
✦───✦      MINECRAFT       ✦───✦
✦     ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ʙᴜʏ
┃┄⊰❀ ꜱʜᴏᴘ
┃┄⊰❀ ᴍɪɴᴇ
┃┄⊰❀ ʀᴇɢ-ɪɴᴠ
┃┄⊰❀ ɪɴᴠᴇɴᴛᴏʀʏ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀\n\n`;  
      
       if (ECOstatus == "true") {
        textHelpMenu += `✦      ╔═════ஓ๑♡๑ஓ═════╗
✦────✦       ECONOMY      ✦────✦
✦      ╚═════ஓ๑♡๑ஓ═════╝
┃┄⊰❀ ʟʙ
┃┄⊰❀ ʀᴏʙ
┃┄⊰❀ ꜱʟᴏᴛ
┃┄⊰❀ ʙᴀɴᴋ
┃┄⊰❀ ᴅᴀɪʟʏ
┃┄⊰❀ ᴡᴀʟʟᴇᴛ
┃┄⊰❀ ᴛʀᴀɴꜱꜰᴇʀ
┃┄⊰❀ ᴡɪᴛʜᴅʀᴀᴡ
┃┄⊰❀ ᴅᴇᴘᴏꜱɪᴛ
┃┄⊰❀ ɢᴀᴍʙʟᴇ
┃┄⊰❀ ᴄᴀᴘᴀᴄɪᴛʏ
┖❀⊱┄┄┄┄┄┄┄┄┄┄┄⊰❀\n\n`;
      }

      if (NSFWstatus == "true") {
        textHelpMenu += `╭────ꕥ NSFW ꕥ────╮
├
├・ 🥵 xᴠɪᴅᴇᴏꜱ <ᴀɴʏ ꜱᴇᴀʀᴄʜ ᴛᴇʀᴍ>
├・ 🥵 ʜᴇɴᴛᴀɪᴠɪᴅᴇᴏ
├・ 🥵 ᴘᴜꜱꜱʏ, ꜱᴘʀᴇᴀᴅᴘᴜꜱꜱʏ,
├・ 🥵 ɢᴇɴꜱʜɪɴ, ꜱQᴜɪʀᴛ,
├・ 🥵 ɢʟᴀꜱꜱᴇꜱ, ꜱᴜɴɢʟᴀꜱꜱᴇꜱ,
├・ 🥵 ꜱᴡɪᴍꜱᴜɪᴛ, ꜱᴄʜᴏᴏʟꜱᴡɪᴍꜱᴜɪᴛ,
├・ 🥵 ʜᴏʟᴏ ʟɪᴠᴇ, ᴀꜱꜱ,
├・ 🥵 ᴜɴᴅᴇʀᴡᴇᴀʀ, ɴɪᴘᴘʟᴇꜱ,
├・ 🥵 ᴜɴᴄᴇɴꜱᴏʀᴇᴅ, ɴɪᴘᴘʟᴇꜱ,
├・ 🥵 ᴜɴᴄᴇɴꜱᴏʀᴇᴅ, ꜱᴇx,
├・ 🥵 ꜱᴇx2, ꜱᴇx3,
├・ 🥵 ʙʟᴏɴᴅᴇ, ᴛᴡɪɴᴛᴀɪʟꜱ,
├・ 🥵 ʙʀᴇᴀꜱᴛꜱ, ᴛʜɪɢʜʜɪɢʜꜱ,
├・ 🥵 ꜱᴋɪʀᴛ, ɢᴀᴍᴇᴄɢ,
├・ 🥵 ᴀɴɪᴍᴀʟᴇᴀʀꜱ, ꜰᴏxɢɪʀʟ,
├・ 🥵 ᴅʀᴇꜱꜱ, ꜱᴄʜᴏᴏʟᴜɴɪꜰᴏʀᴍ,
├・ 🥵 ᴛᴡᴏɢɪʀʟꜱ, ɢʟᴏᴠᴇꜱ,
├・ 🥵 ᴠᴏᴄᴀʟᴏɪᴅ, ᴛᴏᴜʜᴏᴜ,
├・ 🥵 ᴡᴇᴀᴘᴏɴ, ᴡɪᴛʜꜰʟᴏᴡᴇʀꜱ,
├・ 🥵 ᴘɪɴᴋʜᴀɪʀ, ᴄʟᴏᴜᴅꜱᴠɪᴇᴡ,
├・ 🥵 ᴡʜɪᴛᴇ, ᴀɴɪᴍᴀʟ,
├・ 🥵 ᴛᴀɪʟ, ɴᴜᴅᴇ,
├・ 🥵 ᴘᴏɴʏᴛᴀɪʟ, ʙᴇᴅ,
├・ 🥵 ᴡʜɪᴛᴇ ʜᴀɪʀ, ʀɪʙʙᴏɴꜱ,
├・ 🥵 ᴊᴀᴘᴀɴᴇꜱᴇᴄʟᴏᴛʜꜱ, 
├・ 🥵 ʜᴀᴛꜱᴜɴᴇᴍɪᴋᴜ,
├・ 🥵 ʙɪᴋɪɴɪ, ʙᴀʀᴇꜰᴏᴏᴛ,
├・ 🥵 ɴᴏʙʀᴀ, ꜰᴏᴏᴅ,
├・ 🥵 ᴡɪɴɢꜱ, ᴘᴀɴᴛʏʜᴏꜱᴇ,
├・ 🥵 ᴏᴘᴇɴꜱʜɪʀᴛ, ʜᴇᴀᴅʙᴀɴᴅ,
├・ 🥵 ᴘᴇɴɪꜱ, ᴄʟᴏꜱᴇ,
├・ 🥵 ᴡᴇᴛ, ᴄᴀᴛɢɪʀʟ,
├・ 🥵 ᴡᴏʟꜰɢɪʀʟ, ɴᴇᴋᴏ,
├・ 🥵 ʟᴏʟɪ, ꜱᴘʀᴇᴀᴅʟᴇɢꜱ,
├・ 🥵 ʙʀᴀ, ꜰᴀᴛᴇꜱᴇʀɪᴇꜱ,
├・ 🥵 ᴛʀᴇᴇ, ᴇʟʙᴏᴡɢʟᴏᴠᴇꜱ,
├・ 🥵 ɢʀᴇᴇɴʜᴀɪʀ, ʜᴏʀɴꜱ,
├・ 🥵 ᴡɪᴛʜᴘᴇᴛᴀʟꜱ, ᴅʀᴜɴᴋ,
├・ 🥵 ᴄᴜᴍ, ʜᴇᴀᴅ ᴅʀᴇꜱꜱ,
├・ 🥵 ᴛɪᴇ, ꜱʜᴏʀᴛꜱ,
├・ 🥵 ᴍᴀɪᴅ, ʜᴇᴀᴅᴘʜᴏɴᴇꜱ,
├・ 🥵 ᴀɴᴜꜱᴠɪᴇᴡ, ɪᴅᴏʟ,
├・ 🥵 ɢᴜɴ, ꜱᴛᴏᴄᴋɪɴɢꜱ,
├・ 🥵 ᴛᴇᴀʀꜱ, ʙʀᴇᴀꜱᴛʜᴏʟᴅ,
├・ 🥵 ɴᴇᴄᴋʟᴀᴄᴇ, ꜱᴇᴇᴛʜʀᴏᴜɢʜ,
├・ 🥵 ʙᴜɴɴʏᴇᴀʀꜱ, ʙᴜɴɴʏɢɪʀʟ,
├・ 🥵 ᴛᴏᴘʟᴇꜱꜱ, ʙᴇᴀᴄʜ,
├・ 🥵 ᴇʀᴇᴄᴛɴɪᴘᴘʟᴇꜱ, ʏᴜʀɪ,
├・ 🥵 ᴠᴀᴍᴘɪʀᴇ, ꜱʜɪʀᴛ,
├・ 🥵 ᴘᴀɴᴛʏᴘᴜʟʟ, ᴛᴏʀɴᴄʟᴏᴛʜᴇꜱ,
├・ 🥵 ʙᴏɴᴅᴀɢᴇ, ꜰɪɴɢᴇʀɪɴɢ
├・ 🥵 ʙᴇʟʟ, ꜱʜɪʀᴛʟɪꜰᴛ,
├・ 🥵 ᴛᴀᴛᴛᴏᴏ, ᴄʜᴀɪɴ,
├・ 🥵 ꜰʟᴀᴛᴄʜᴇꜱᴛ 
├
╰──────────────────╯\n\n`;
      }

      textHelpMenu += `*🌀  ${botName}  🌀*
 _Powered By:_ *Team CELESTIC BOTTO ©2023*

🌸 To use any of these commands type " *${prefix}Command name* ".

🐲 To get Support Group link type " *${prefix}support* ".

♣️ To report any issues to Developer type " *${prefix}report <describe issue>* ".\n`;

      
      await Miku.sendMessage(m.from, {video: { url: botVideo }, gifPlayback: true, caption: textHelpMenu,}, { quoted: m });
    }
  },
};
